Repository: CleoMenezesJr/escambo
Catalog: po/*.po
Languages: de, tr

source: An HTTP-based APIs test application for GNOME
de: Eine HTTP-basierende APIs Test App für GNOME
tr: GNOME için HTTP tabanlı API test uygulaması

source: Test and develop APIs
de: Teste und entwickle APIs
tr: API test et ve geliştir

source: Main window - Light mode
de: Hauptfenster - Heller Modus
tr: Ana pencere - Açık kip

source: Main window - Dark mode
de: Hauptfenster - Dunkler Modus
tr: Ana pencere - Koyu kip

source: Escambo is an HTTP-based APIs test application for GNOME.
de: Escambo ist eine HTTP-basierende APIs Test App für GNOME.
tr: Escambo, GNOME için HTTP tabanlı API test uygulamasıdır.

source: Fix inability to select response code
tr: Yanıt kodunu seçememe hatası düzeltildi

source: Update to Blueprint to 0.8.1
tr: Blueprint 0.8.1 sürümüne güncellendi

source: Update Brazilian Portuguese translation
tr: Brezilya Portekizcesi çevirisi güncellendi

source: Add German translation
tr: Almanca çeviri eklendi

source: Be able to create Header with empty value
tr: Boş değerle Üst Bilgi oluşturmak artık mümkün

source: Check for duplicate data keys
tr: Çift veri anahtarları denetimi

source: Add new way to add new Body Form Data
tr: Gövde Formu Verileri eklemenin yeni bir yolu eklendi

source: and many more
tr: ve çok daha fazlası

source: Welcome to Escambo
de: Willkommen bei Escambo
tr: Escamboʼya Hoş Geldiniz

source: Method type
de: Methodentyp
tr: Metot türü

source: Select method type dropdown.
de: Wähle einen Methodentyp in der Dropdown-Liste.
tr: Metot türü açılır menüsü seç.

source: URL input field content.
tr: URL girdi alanı içeriği.

source: Parameters
de: Parameter
tr: Parametreler

source: Toggle parameters switch.
de: Parameter Schalter umschalten.
tr: Parametreler düğmesini aç/kapat.

source: Body
de: Nachrichtenrumpf
tr: Gövde

source: Toggle body switch.
de: Nachrichtenrumpf Schalter umschalten.
tr: Gövde düğmesini aç/kapat.

source: Body type
de: Nachrichtenrumpftyp
tr: Gövde türü

source: Toggle body type button.
de: Nachrichtenrumpftyp Schalter umschalten.
tr: Gövde türü düğmesi aç/kapat.

source: Cookies
tr: Çerezler

source: Toggle cookies switch.
de: Cookies Schalter umschalten.
tr: Çerezler düğmesini aç/kapat.

source: Headers
tr: Üst Bilgiler

source: Toggle headers switch.
de: Header Schalter umschalten.
tr: Üst bilgiler düğmesini aç/kapat.

source: Authorizations
tr: Yetkilendirme

source: Toggle authorizations switch.
tr: Yetkilendirme düğmesini aç/kapat.

source: Authorization type
tr: Yetkilendirme türü

source: Select authorization type dropdown.
tr: Yetkilendirme türü açılır menüsü seç.

source: Are you sure you want to delete it?
tr: Silmek istediğinize emin misiniz?

source: Cancel
tr: İptal

source: Delete
tr: Sil

source: Edit Cookie
tr: Çerez Düzenle

source: Edit Header
tr: Üst Bilgi Düzenle

source: Edit Body
tr: Gövde Düzenle

source: New Cookie
tr: Yeni Çerez

source: New Header
tr: Yeni Üst Bilgi

source: New Body
de: Neuer Nachrichtenrumpf
tr: Yeni Gövde

source: Enter a URL
tr: URL giriniz

source: URL using bad/illegal format or missing URL
tr: URL Kötü/geçersiz biçimlendirilmiş veya yok

source: Body must be in JSON format
tr: Gövde JSON biçiminde olmalıdır

source: Error: Couldn't resolve host name
tr: Hata: Ana bilgisayar adı çözümlenemedi

source: Cookie created
tr: Çerez oluşturuldu

source: Cookie edited
tr: Çerez düzenlendi

source: Header created
tr: Üst bilgi oluşturuldu

source: Header edited
tr: Üst bilgi düzenlendi

source: Key “{title}” already exists
tr: “{title}” anahtarı zaten var

source: Body created
tr: Gövde oluşturuldu

source: Body edited
tr: Gövde düzenlendi

source: Key already exists
tr: Anahtar zaten var

source: Time
tr: Saat

source: _Cancel
tr: _İptal

source: Add
de: Hinzufügen
tr: Ekle

source: Key
de: Schlüssel
tr: Anahtar

source: Value
de: Wert
tr: Değer

source: Name
tr: Ad

source: Domain
tr: Alan adı

source: Path
tr: Yol

source: Expirable
tr: Süresi dolmuş

source: Expires
tr: Son Kullanım

source: Select date
tr: Tarih seç

# shortcut window
source: General
tr: Genel

# shortcut window
source: Show Shortcuts
tr: Kısayolları Göster

# shortcut window
source: Show Response Page
tr: Yanıt Sayfasını Göster

# shortcut window
source: Send Request
tr: İstek Gönder

# shortcut window
source: Quit
tr: Çık

source: Populator Entry
tr: [giriş yok]

source: Edit
tr: Düzen

source: Remove
tr: Kaldır

source: _Endpoint
de: _Endpunkt
tr: _Sorgu Adresi

source: HTTP request methods
de: HTTP Anfrage Methoden
tr: HTTP istek metotları

source: Method
de: Methode
tr: Metot

source: Send Request
de: Anfrage absenden
tr: İstek Gönder

source: Send REST
tr: REST Gönder

source: Query Parameters
de: Abfrage Parameter
tr: Sorgu Parametreleri

source: Go to edit Parameters
de: Parameter bearbeiten
tr: Parametre Düzenlemeye Git

source: Go to edit Body
de: Nachrichtenrumpf bearbeiten
tr: Gövde Düzenlemeye Git

source: Form Data
tr: Form Verisi

source: Raw
de: Original
tr: Ham

source: _Cookies
tr: _Çerezler

source: Create New Cookie...
de: Neuen Cookie Erstellen
tr: Yeni Çerez Oluştur...

source: _Headers
tr: _Üst Bilgiler

source: Create New Header...
de: Neuen Header ERstellen…
tr: Yeni Üst Bilgi Oluştur...

source: Authorization
de: Authentifizierung
tr: Yetkilendirme

source: Type
de: Typ
tr: Tür

source: Api Key
tr: API Anahtarı

source: Bearer Token
tr: Bearer Jetonu

source: Add to
de: Hinzufügen zu
tr: Şuraya ekle

source: Header
tr: Üst Bilgi

source: Token
tr: Jeton

source: Loading…
de: Lade…
tr: Yükleniyor…

source: Response
tr: Yanıt

source: Back
de: Zurück
tr: Geri

source: JSON Format
tr: JSON Biçimi

source: Create New Body...
tr: Yeni Gövde Oluştur...

source: Edit Parameters
tr: Parametreleri Düzenle

source: New Parameter
de: Neuer Parameter
tr: Yeni Parametre

source: _Show Response
de: _Zeige Antwort
tr: Yanıtı _Göster

source: _Keyboard Shortcuts
de: _Tastenkürzel
tr: Klavye _Kısayolları

source: _About Escambo
de: _Info zu Escambo
tr: Escambo _Hakkında

source: Popular URL entry.
de: Beliebte URL Einträge.

source: Authentication
de: Authentifizierung

source: Toggle auths switch.
de: Auth Schalter umschalten.

source: Select auth type dropdown.
de: Wähle Authtyp aus der Dropdown-List.
